// 우리들의 영화정보 객체들 //////////

// 탐쌤꼬야의 오브젝트!!!
// 변경 가능하도록 let으로 선언!
let 탐쌤꼬야 = {};
// 오브젝트 형만 리터럴로 만들고 객체내용은 아래에서 생성!

// 1. 영화제목
탐쌤꼬야.title = "외계+인 2부";
// 2. 감독
탐쌤꼬야.director = "최동훈";
// 3. 배우
탐쌤꼬야.actor = "류준열, 김태리, 김우빈";
// 4. 장르
탐쌤꼬야.genre = "액션,다크 판타지,코미디";
// 5. 관람가
탐쌤꼬야.ratings = "12세";
// 6. 예고편
탐쌤꼬야.trailer = function () {
  console.log("예고편:영화아이디");
  // 예고편 플레이 함수호출!
  playMovie("4uSn4Dem9i0");
};

// 손종준 오브젝트
// // 변경 하기
let 손종준 = {}; // 오브젝트 형만 리터럴로 만들고 객체내용은 아래에서 생성

// 1. 영화제목
손종준.title = "퍼펙트블루";
// 2. 감독
손종준.director = "곤 사토시";
// 3. 배우
손종준.actor = "이와오 준코, 마츠모토 리카";
// 4. 장르
손종준.genre = "애니메이션, 미스터리";
// 5. 관람가
손종준.ratings = "청소년 관람불가";
// 6. 예고편
손종준.trailer = function () {
  console.log("예고편:mSmV_eTC78A");
  // 예고편 플레이 함수호출!
  playMovie("mSmV_eTC78A");
};

// 강지희의 오브젝트!!!
let 강지희 = {};
// 오브젝트 형만 리터럴로 만들고 객체내용은 아래에서 생성!

// 1. 영화제목
강지희.title = "Wicked: For Good";
// 2. 감독
강지희.director = "존추";
// 3. 배우
강지희.actor = "신시아에리보, 아리아나그란데, 조나단베일리";
// 4. 장르
강지희.genre = "판타지, 뮤지컬";
// 5. 관람가
강지희.ratings = "전체 관람가";
// 6. 예고편
강지희.trailer = function () {
  console.log("예고편:영화아이디");
  // 예고편 플레이 함수호출!
  playMovie("hjjISKnEK1s");
};

// 성은의 오브젝트!!!
// 변경 가능하도록 let으로 선언!
let 성은 = {};
// 오브젝트 형만 리터럴로 만들고 객체내용은 아래에서 생성!

// 1. 영화제목
성은.title = "히든 피겨스";
// 2. 감독
성은.director = "데오도르 멜피";
// 3. 배우
성은.actor = "옥타비아 스펜서, 타라지 P.헨슨, 자넬 모네";
// 4. 장르
성은.genre = "드라마";
// 5. 관람가
성은.ratings = "12세";
// 6. 예고편
성은.trailer = function () {
  console.log("예고편:영화아이디");
  // 예고편 플레이 함수호출!
  playMovie("ItSUOpH4A5w");
};

// chohyun의 오브젝트!!!
// 변경 가능하도록 let으로 선언!
let chohyun = {};
// 오브젝트 형만 리터럴로 만들고 객체내용은 아래에서 생성!

// 1. 영화제목
chohyun.title = "바다 탐험대 옥토넛 어보브 앤 비욘드 : 콰지의 깜짝 어드벤처";
// 2. 감독
chohyun.director = "패트리스 베루베";
// 3. 배우
chohyun.actor = "애니메이션";
// 4. 장르
chohyun.genre = "애니메이션, 액션, 어드벤쳐";
// 5. 관람가
chohyun.ratings = "전체관람가";
// 6. 예고편
chohyun.trailer = function () {
  console.log("예고편:영화아이디");
  // 예고편 플레이 함수호출!
  playMovie("YGLrpdqsFvc");
};

// 김근해의 오브젝트!
// 변경 가능하도록 let으로 선언
let 김근해 = {};
// 오브젝트 형만 리터럴로 만들고 객체내용은 아래에서 생성

// 1. 영화제목
김근해.title = "코렐라인";
// 2. 감독
김근해.director = "헨리 셀릭";
// 3. 배우
김근해.actor = "다코타 패닝, 테리 해처";
// 4. 장르
김근해.genre = "애니메이션";
// 5. 관람가
김근해.ratings = "12세 이상";
// 6. 예고편
김근해.trailer = function () {
  console.log("예고편:영화아이디");
  // 예고편 플레이 함수호출!
  playMovie("OYANsqfmA5A");
};

// 재은의 오브젝트!!!
// // 변경 가능하도록 let으로 선언!
let 재은 = {};
// 오브젝트 형만 리터럴로 만들고 객체내용은 아래에서 생성!

// 1. 영화제목
재은.title = "귀멸의 칼날:무한성 편";
// 2. 감독
재은.director = "소토자키하루오";
// 3. 배우
재은.actor = "탄지로,네즈코,젠이츠,이노스케";
// 4. 장르
재은.genre = "애니메이션";
// 5. 관람가
재은.ratings = "12세";
// 6. 예고편
재은.trailer = function () {
  console.log("예고편:영화아이디");
  // 예고편 플레이 함수호출!
  playMovie("zN8K_uE1LYg");
};
